In [30]:
import pandas as pd
import numpy as np

In [31]:
datadict={"Age":[28,27,40,32,29],"Salary":[10000,15000,11000,11000,13000]}

In [32]:

df=pd.DataFrame.from_dict(datadict)
df

   Age  Salary
0   28   10000
1   27   15000
2   40   11000
3   32   11000
4   29   13000

In [33]:
#normaliztion
((df- df.min()) / (df.max()-df.min()))

        Age  Salary
0  0.076923     0.0
1  0.000000     1.0
2  1.000000     0.2
3  0.384615     0.2
4  0.153846     0.6

In [34]:
# standardiztaion
(df-df.mean())/df.std()

        Age  Salary
0 -0.608009    -1.0
1 -0.798012     1.5
2  1.672025    -0.5
3  0.152002    -0.5
4 -0.418006     0.5

In [36]:
((df-df.mean())/df.std()).std()

Age       1.0
Salary    1.0
dtype: float64